; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-4-34)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p1-2 - location
	p3-0 - location
	p3-4 - location
	p3-5 - location
	p4-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s4)
	(at driver5 s4)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s0)
	(at package2 s5)
	(at package3 s2)
	(at package4 s1)
	(at package5 s0)
	(at package6 s2)
	(at package7 s3)
	(at package8 s1)
	(at package9 s2)
	(at package10 s5)
	(at package11 s2)
	(at package12 s2)
	(at package13 s2)
	(at package14 s0)
	(at package15 s0)
	(at package16 s1)
	(at package17 s2)
	(at package18 s4)
	(at package19 s2)
	(at package20 s1)
	(at package21 s2)
	(at package22 s2)
	(at package23 s2)
	(at package24 s1)
	(at package25 s2)
	(at package26 s0)
	(at package27 s3)
	(at package28 s1)
	(at package29 s4)
	(at package30 s5)
	(at package31 s0)
	(at package32 s1)
	(at package33 s3)
	(at package34 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s3 s5)
	(link s5 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at package1 s4)
	(at package2 s0)
	(at package3 s3)
	(at package5 s1)
	(at package6 s5)
	(at package7 s0)
	(at package8 s5)
	(at package9 s3)
	(at package10 s5)
	(at package11 s0)
	(at package12 s0)
	(at package13 s2)
	(at package14 s3)
	(at package15 s3)
	(at package16 s0)
	(at package17 s3)
	(at package18 s5)
	(at package19 s2)
	(at package20 s2)
	(at package21 s4)
	(at package22 s0)
	(at package23 s3)
	(at package24 s4)
	(at package25 s5)
	(at package26 s0)
	(at package27 s2)
	(at package28 s1)
	(at package29 s3)
	(at package30 s4)
	(at package31 s1)
	(at package33 s0)
	(at package34 s2)
	))


)

; plan
1. (board-truck driver4 s4 truck2)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 7 of 39
2. (board-truck driver5 s4 truck3)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 7 of 39
3. (drive-truck driver5 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 7 of 39
4. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 8 of 39
5. (drive-truck driver4 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 8 of 39
6. (load-truck s1 package8 truck2)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 8 of 39
7. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 8 of 39
8. (load-truck s3 package7 truck2)
   deleted: (at package7 s3)
   added: (in package7 truck2)
   goals met: 8 of 39
9. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 8 of 39
10. (drive-truck driver4 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 8 of 39
11. (unload-truck s0 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   goals met: 9 of 39
12. (load-truck s0 package5 truck2)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   goals met: 9 of 39
13. (drive-truck driver4 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 9 of 39
14. (load-truck s4 package29 truck2)
   deleted: (at package29 s4)
   added: (in package29 truck2)
   goals met: 9 of 39
15. (drive-truck driver4 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 9 of 39
16. (unload-truck s1 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 10 of 39
17. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 10 of 39
18. (load-truck s3 package33 truck2)
   deleted: (at package33 s3)
   added: (in package33 truck2)
   goals met: 10 of 39
19. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 10 of 39
20. (drive-truck driver4 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 10 of 39
21. (unload-truck s0 package33 truck2)
   deleted: (in package33 truck2)
   added: (at package33 s0)
   goals met: 11 of 39
22. (load-truck s0 package31 truck2)
   deleted: (at package31 s0)
   added: (in package31 truck2)
   goals met: 11 of 39
23. (drive-truck driver4 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 11 of 39
24. (drive-truck driver4 s4 s1 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   goals met: 11 of 39
25. (unload-truck s1 package31 truck2)
   deleted: (in package31 truck2)
   added: (at package31 s1)
   goals met: 12 of 39
26. (load-truck s1 package24 truck2)
   deleted: (at package24 s1)
   added: (in package24 truck2)
   goals met: 12 of 39
27. (drive-truck driver4 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 12 of 39
28. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 12 of 39
29. (unload-truck s5 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s5)
   goals met: 13 of 39
30. (load-truck s5 package30 truck2)
   deleted: (at package30 s5)
   added: (in package30 truck2)
   goals met: 13 of 39
31. (drive-truck driver4 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 13 of 39
32. (drive-truck driver4 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 13 of 39
33. (unload-truck s4 package30 truck2)
   deleted: (in package30 truck2)
   added: (at package30 s4)
   goals met: 14 of 39
34. (unload-truck s4 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s4)
   goals met: 15 of 39
35. (drive-truck driver4 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 15 of 39
36. (load-truck s0 package15 truck2)
   deleted: (at package15 s0)
   added: (in package15 truck2)
   goals met: 15 of 39
37. (drive-truck driver4 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 15 of 39
38. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 15 of 39
39. (unload-truck s3 package29 truck2)
   deleted: (in package29 truck2)
   added: (at package29 s3)
   goals met: 16 of 39
40. (load-truck s3 package27 truck2)
   deleted: (at package27 s3)
   added: (in package27 truck2)
   goals met: 16 of 39
41. (unload-truck s3 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   goals met: 17 of 39
42. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 17 of 39
43. (drive-truck driver4 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 17 of 39
44. (load-truck s4 package18 truck2)
   deleted: (at package18 s4)
   added: (in package18 truck2)
   goals met: 17 of 39
45. (drive-truck driver4 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 17 of 39
46. (load-truck s0 package14 truck2)
   deleted: (at package14 s0)
   added: (in package14 truck2)
   goals met: 17 of 39
47. (drive-truck driver4 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 17 of 39
48. (load-truck s5 package2 truck2)
   deleted: (at package2 s5)
   added: (in package2 truck2)
   goals met: 17 of 39
49. (unload-truck s5 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s5)
   goals met: 18 of 39
50. (drive-truck driver4 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 18 of 39
51. (unload-truck s0 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   goals met: 19 of 39
52. (load-truck s0 package1 truck2)
   deleted: (at package1 s0)
   added: (in package1 truck2)
   goals met: 19 of 39
53. (drive-truck driver4 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 19 of 39
54. (drive-truck driver5 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 18 of 39
55. (drive-truck driver5 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 18 of 39
56. (load-truck s2 package9 truck2)
   deleted: (at package9 s2)
   added: (in package9 truck2)
   goals met: 18 of 39
57. (load-truck s2 package6 truck2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 18 of 39
58. (load-truck s2 package3 truck2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 18 of 39
59. (unload-truck s2 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s2)
   goals met: 19 of 39
60. (load-truck s2 package25 truck2)
   deleted: (at package25 s2)
   added: (in package25 truck2)
   goals met: 19 of 39
61. (load-truck s2 package23 truck2)
   deleted: (at package23 s2)
   added: (in package23 truck2)
   goals met: 19 of 39
62. (load-truck s2 package22 truck2)
   deleted: (at package22 s2)
   added: (in package22 truck2)
   goals met: 19 of 39
63. (load-truck s2 package21 truck2)
   deleted: (at package21 s2)
   added: (in package21 truck2)
   goals met: 19 of 39
64. (load-truck s2 package17 truck2)
   deleted: (at package17 s2)
   added: (in package17 truck2)
   goals met: 19 of 39
65. (drive-truck driver4 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 19 of 39
66. (unload-truck s5 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   goals met: 20 of 39
67. (unload-truck s5 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s5)
   goals met: 21 of 39
68. (board-truck driver1 s2 truck4)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 21 of 39
69. (load-truck s1 package20 truck3)
   deleted: (at package20 s1)
   added: (in package20 truck3)
   goals met: 21 of 39
70. (drive-truck driver5 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 21 of 39
71. (drive-truck driver5 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 22 of 39
72. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 22 of 39
73. (unload-truck s3 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s3)
   goals met: 23 of 39
74. (unload-truck s3 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   goals met: 24 of 39
75. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 24 of 39
76. (unload-truck s2 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s2)
   goals met: 25 of 39
77. (drive-truck driver1 s2 s0 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 25 of 39
78. (load-truck s2 package12 truck3)
   deleted: (at package12 s2)
   added: (in package12 truck3)
   goals met: 25 of 39
79. (load-truck s2 package11 truck3)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   goals met: 25 of 39
80. (drive-truck driver1 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 25 of 39
81. (drive-truck driver1 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 26 of 39
82. (load-truck s1 package16 truck4)
   deleted: (at package16 s1)
   added: (in package16 truck4)
   goals met: 26 of 39
83. (drive-truck driver1 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 25 of 39
84. (drive-truck driver1 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 25 of 39
85. (unload-truck s0 package16 truck4)
   deleted: (in package16 truck4)
   added: (at package16 s0)
   goals met: 26 of 39
86. (drive-truck driver5 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 25 of 39
87. (unload-truck s0 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s0)
   goals met: 26 of 39
88. (unload-truck s0 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s0)
   goals met: 27 of 39
89. (drive-truck driver5 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 28 of 39
90. (disembark-truck driver5 s2 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s2) (empty truck3)
   goals met: 28 of 39
91. (board-truck driver2 s2 truck3)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 28 of 39
92. (drive-truck driver4 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 28 of 39
93. (unload-truck s0 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s0)
   goals met: 29 of 39
94. (drive-truck driver4 s0 s4 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   goals met: 29 of 39
95. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 29 of 39
96. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 29 of 39
97. (unload-truck s3 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s3)
   goals met: 30 of 39
98. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 30 of 39
99. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 30 of 39
100. (unload-truck s4 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s4)
   goals met: 31 of 39
101. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 31 of 39
102. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 31 of 39
103. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 32 of 39
104. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 32 of 39
105. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 32 of 39
106. (unload-truck s4 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   goals met: 33 of 39
107. (drive-truck driver4 s4 s0 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   goals met: 33 of 39
108. (drive-truck driver4 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 33 of 39
109. (drive-truck driver4 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 33 of 39
110. (unload-truck s3 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s3)
   goals met: 34 of 39
111. (disembark-truck driver4 s3 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s3) (empty truck2)
   goals met: 34 of 39
112. (walk driver4 s3 p3-0)
   deleted: (at driver4 s3)
   added: (at driver4 p3-0)
   goals met: 34 of 39
113. (walk driver4 p3-0 s0)
   deleted: (at driver4 p3-0)
   added: (at driver4 s0)
   goals met: 35 of 39
114. (drive-truck driver2 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 34 of 39
115. (disembark-truck driver1 s0 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 35 of 39
116. (board-truck driver4 s0 truck4)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 34 of 39
117. (drive-truck driver4 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 34 of 39
118. (drive-truck driver4 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 35 of 39
119. (disembark-truck driver4 s1 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 35 of 39
120. (walk driver4 s1 p0-1)
   deleted: (at driver4 s1)
   added: (at driver4 p0-1)
   goals met: 35 of 39
121. (walk driver4 p0-1 s0)
   deleted: (at driver4 p0-1)
   added: (at driver4 s0)
   goals met: 36 of 39
122. (disembark-truck driver2 s5 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s5) (empty truck3)
   goals met: 36 of 39
123. (board-truck driver3 s5 truck3)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 36 of 39
124. (drive-truck driver3 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 37 of 39
125. (disembark-truck driver3 s2 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 38 of 39
126. (walk driver2 s5 p3-5)
   deleted: (at driver2 s5)
   added: (at driver2 p3-5)
   goals met: 38 of 39
127. (walk driver2 p3-5 s3)
   deleted: (at driver2 p3-5)
   added: (at driver2 s3)
   goals met: 39 of 39
